//######################################################################
//###########################           SSTech       ###################
//###########################   Programming Courses  ###################
//######################################################################

let old: number;

old = parseInt(prompt(' الرجاء كتابة عمرك'));
if (old == 1 || old == 2) {
  console.log(' رضيع ');
} else if (old >= 3 && old <= 14) {
  console.log(' طفل ');
} else if (old >= 15 && old <= 21) {
  console.log(' شاب ');
} else if (old >= 22) {
  console.log(' رجل ');
}
